__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_Sequence (InputLayer)     (None, 15, 2)        0                                            
__________________________________________________________________________________________________
Encoder_RNN_1 (SimpleRNN)       [(None, 15, 200), (N 40600       Input_Sequence[0][0]             
__________________________________________________________________________________________________
Encoder_RNN_2 (SimpleRNN)       [(None, 15, 200), (N 80200       Encoder_RNN_1[0][0]              
__________________________________________________________________________________________________
Encoder_RNN_3 (SimpleRNN)       [(None, 200), (None, 80200       Encoder_RNN_2[0][0]              
__________________________________________________________________________________________________
Encoder_State_Fusion (Concatena (None, 600)          0           Encoder_RNN_1[0][1]              
                                                                 Encoder_RNN_2[0][1]              
                                                                 Encoder_RNN_3[0][1]              
__________________________________________________________________________________________________
Latent (Dense)                  (None, 15)           9015        Encoder_State_Fusion[0][0]       
__________________________________________________________________________________________________
Latent_Sequence (RepeatVector)  (None, 15, 15)       0           Latent[0][0]                     
__________________________________________________________________________________________________
Decoder_RNN_1 (SimpleRNN)       (None, 15, 200)      43200       Latent_Sequence[0][0]            
__________________________________________________________________________________________________
Decoder_RNN_2 (SimpleRNN)       (None, 15, 200)      80200       Decoder_RNN_1[0][0]              
__________________________________________________________________________________________________
Decoder_RNN_3 (SimpleRNN)       (None, 15, 200)      80200       Decoder_RNN_2[0][0]              
__________________________________________________________________________________________________
Output_Sequence (TimeDistribute (None, 15, 2)        402         Decoder_RNN_3[0][0]              
==================================================================================================
Total params: 414,017
Trainable params: 414,017
Non-trainable params: 0
__________________________________________________________________________________________________
